# Assignment: Pandas Advance - 1

In [1]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [2]:
df = pd.DataFrame({'Num': [1,2,3,4,5]})

In [3]:
df

   Num
0    1
1    2
2    3
3    4
4    5

In [4]:
# 1) Sum Function

df['Num'].sum()

15

In [9]:
# 2) Average Function

df['Num'].mean()

3.0

In [11]:
# 3) Median Function

df['Num'].median()

3.0

In [12]:
# 4) Mode Function

df['Num'].mode()

0    1
1    2
2    3
3    4
4    5
Name: Num, dtype: int64

In [13]:
# 5) Standard Deviation Function

df['Num'].std()

1.5811388300841898

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [15]:
df = pd.DataFrame({'A':  [1,2,3,4], 'B': [3,4,5,6], 'C': [6,7,8,9]})

In [16]:
df

   A  B  C
0  1  3  6
1  2  4  7
2  3  5  8
3  4  6  9

In [17]:
df.reindex([1,3,5,7])

     A    B    C
1  2.0  4.0  7.0
3  4.0  6.0  9.0
5  NaN  NaN  NaN
7  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [27]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [28]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [29]:
df.iloc[0:3].sum()

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [30]:
df = pd.DataFrame({'Text': ['Hi my name is Faijan', 'I am a working professional', 'I will be a Data Scientist']})

In [31]:
df

                          Text
0         Hi my name is Faijan
1  I am a working professional
2   I will be a Data Scientist

In [34]:
df['Word_Count']= df['Text'].apply(lambda x: len(x.split()))

In [35]:
df

                          Text  Word_Count
0         Hi my name is Faijan           5
1  I am a working professional           5
2   I will be a Data Scientist           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [48]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50], 'A': [1,3,4,5,6]})

In [49]:
df

   Values  A
0      10  1
1      20  3
2      30  4
3      40  5
4      50  6

### DataFrame.Size provide only the length of the data i.e how many total entries are present in the Dataframe

### whereas DataFrame.shape provide both the counts of length of the data(number of rows) and how many columns are present in it

In [52]:
df.shape

(5, 2)

In [53]:
df.size

10

Q6. Which function of pandas do we use to read an excel file?

We use : pd.read_excel('Filelocation.xlsx')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [54]:
df = pd.DataFrame({'Email': ['faijanoffical7@gamil.com', 'abc@gmail.com', 'xyz@gmail.com']})

In [55]:
df

                      Email
0  faijanoffical7@gamil.com
1             abc@gmail.com
2             xyz@gmail.com

In [66]:
df['Username']= df['Email'].apply(lambda x: x.split(sep='@')[0])

In [67]:
df

                      Email        Username
0  faijanoffical7@gamil.com  faijanoffical7
1             abc@gmail.com             abc
2             xyz@gmail.com             xyz

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [68]:
df = pd.DataFrame({'A': [3,8,6,2,9], 'B': [5,2,9,3,1], 'C': [1,7,4,5,2]})

In [69]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [73]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [74]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [75]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [76]:
df.mean()

Values    30.0
dtype: float64

In [77]:
df.median()

Values    30.0
dtype: float64

In [78]:
df.std()

Values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [92]:
df= pd.DataFrame({'Sales' : [1000,2000,3000,5000,4982,2344,23432,2343, 4000, 5000],
                 'Date' : ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10']
                 })

In [93]:
df

   Sales        Date
0   1000  2023-01-01
1   2000  2023-01-02
2   3000  2023-01-03
3   5000  2023-01-04
4   4982  2023-01-05
5   2344  2023-01-06
6  23432  2023-01-07
7   2343  2023-01-08
8   4000  2023-01-09
9   5000  2023-01-10

In [94]:
df.dtypes

Sales     int64
Date     object
dtype: object

In [95]:
df['Date']= pd.to_datetime(df['Date'])

In [96]:
df

   Sales       Date
0   1000 2023-01-01
1   2000 2023-01-02
2   3000 2023-01-03
3   5000 2023-01-04
4   4982 2023-01-05
5   2344 2023-01-06
6  23432 2023-01-07
7   2343 2023-01-08
8   4000 2023-01-09
9   5000 2023-01-10

In [97]:
df.dtypes

Sales             int64
Date     datetime64[ns]
dtype: object

In [99]:
df['MovingAverage'] = df.rolling(window=7).mean()

/tmp/ipykernel_76/464398706.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df['MovingAverage'] = df.rolling(window=7).mean()

In [100]:
df

   Sales       Date  MovingAverage
0   1000 2023-01-01            NaN
1   2000 2023-01-02            NaN
2   3000 2023-01-03            NaN
3   5000 2023-01-04            NaN
4   4982 2023-01-05            NaN
5   2344 2023-01-06            NaN
6  23432 2023-01-07    5965.428571
7   2343 2023-01-08    6157.285714
8   4000 2023-01-09    6443.000000
9   5000 2023-01-10    6728.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [114]:
df= pd.DataFrame({'Date' : ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08', '2023-01-09', '2023-01-10']
                 })

In [115]:
df['Date']= pd.to_datetime(df['Date'])

In [116]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06
6 2023-01-07
7 2023-01-08
8 2023-01-09
9 2023-01-10

In [117]:
df.dtypes

Date    datetime64[ns]
dtype: object

In [118]:
df['Weekday'] = df['Date'].dt.day_name()

In [119]:
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday
7 2023-01-08     Sunday
8 2023-01-09     Monday
9 2023-01-10    Tuesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [123]:
date= pd.date_range('2022-12-01', '2023-03-31')

len(date)

121

In [128]:
import numpy as np

val = np.random.randint(1,1000,121)
len(val)

121

In [129]:
df = pd.DataFrame({'Dates': date , 'Values' : val})

In [130]:
df

         Dates  Values
0   2022-12-01     850
1   2022-12-02     925
2   2022-12-03     410
3   2022-12-04     235
4   2022-12-05     646
..         ...     ...
116 2023-03-27     823
117 2023-03-28     582
118 2023-03-29     834
119 2023-03-30     715
120 2023-03-31     668

[121 rows x 2 columns]

In [131]:
df.loc[df['Dates'].between('2023-01-01', '2023-01-31')]

        Dates  Values
31 2023-01-01     924
32 2023-01-02     406
33 2023-01-03     800
34 2023-01-04     123
35 2023-01-05     139
36 2023-01-06     768
37 2023-01-07      63
38 2023-01-08     902
39 2023-01-09     228
40 2023-01-10     262
41 2023-01-11     998
42 2023-01-12     621
43 2023-01-13     328
44 2023-01-14     742
45 2023-01-15     733
46 2023-01-16     980
47 2023-01-17     261
48 2023-01-18     317
49 2023-01-19     283
50 2023-01-20     721
51 2023-01-21     389
52 2023-01-22     711
53 2023-01-23     587
54 2023-01-24     928
55 2023-01-25     469
56 2023-01-26      77
57 2023-01-27     336
58 2023-01-28     191
59 2023-01-29     902
60 2023-01-30      79
61 2023-01-31      41

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [132]:
import pandas as pd